In [5]:
import sqlite3
import pandas as pd

In [6]:
con = sqlite3.connect("../data/checking-logs.sqlite")

In [25]:
test_results = pd.read_sql(""" WITH Sub_tab1 AS (
    SELECT uid, MIN(first_commit_ts) AS first
    FROM test
    WHERE labname != 'project1'
    GROUP BY uid
),
Sub_tab2 AS (
    SELECT 
        CASE  
            WHEN s1.first < p.datetime THEN 'after' 
            ELSE 'before' 
        END AS time_per,
    (julianday(p.datetime, 'unixepoch') - julianday(s1.first)) * 24 AS time_diff
    FROM pageviews p 
    JOIN Sub_tab1 s1 ON s1.uid = p.uid
    WHERE p.uid != 'project 1 AND p.datetime IS NOT NULL'
)
SELECT time_per, AVG(time_diff) AS avg_d
FROM Sub_tab2
GROUP BY time_per""",con)
test_results

  time_per avg_d
0    after  None
1   before  None

In [17]:
a = pd.read_sql("SELECT * FROM pageviews",con)
a

      index      uid                    datetime
0         0  admin_1  2020-04-17 12:01:08.463179
1         1  admin_1  2020-04-17 12:01:23.743946
2         2  admin_3  2020-04-17 12:17:39.287778
3         3  admin_3  2020-04-17 12:17:40.001768
4         4  admin_1  2020-04-17 12:27:30.646665
...     ...      ...                         ...
1075   1075  user_25  2020-05-21 23:23:49.995349
1076   1076  admin_1  2020-05-21 23:49:22.386789
1077   1077  admin_1  2020-05-22 10:36:14.662600
1078   1078   user_5  2020-05-22 11:30:18.368990
1079   1079  user_17  2020-05-22 18:22:22.847815

[1080 rows x 3 columns]

In [ ]:
con.close()